Backend/app/controllers/api/v1/snippets_controller.rb

SELECT "snippets".* FROM "snippets"
---
  def index
    # @snippets = Snippet.all
    #
    # render json: @snippets
    respond_to do |snippets|
      snippets.json { render json:  Snippet.all }