Backend/app/controllers/api/v1/users_controller.rb

  def index
    respond_to do |users|
      users.json { render json:  User.all }
---
SELECT "users".* FROM "users"